# <font color='red'>Handling Missing Data

we’ll refer to missing data in general as null, NaN, or NA values.

## NaN: Missing numerical data

The other missing data representation, NaN (acronym for Not a Number), is different; it is a special floating-point value recognized by all systems that use the standard IEEE floating-point representation:

In [2]:
import numpy as np

In [3]:
vals2 = np.array([1,2,np.nan,4])

In [5]:
vals2

array([ 1.,  2., nan,  4.])

In [6]:
vals2.dtype

dtype('float64')

You should be aware that NaN is a bit like a data virus—it infects anyother object it touches. Regardless of the operation, the result of arithmetic with NaN will be another NaN:

In [7]:
1 + np.nan

nan

In [8]:
0 * np.nan

nan

In [9]:
# (i.e., they don’t result in an error)

In [10]:
vals2.max()

nan

In [11]:
vals2.min()

nan

In [12]:
# see it infects whole dataset

NumPy does provide some special aggregations that will ignore these missing values:

In [13]:
np.nansum(vals2)

7.0

In [14]:
np.nanmax(vals2)

4.0

In [15]:
np.nanmin(vals2)

1.0

## NaN and None in Pandas

converting between them where appropriate

In [17]:
import pandas as pd

In [18]:
pd.Series([1,2,np.nan,4,None])

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
dtype: float64

For example, if we set a value in an integer array to
np.nan, it will automatically be upcast to a floating-point type to accommodate the NA

In [19]:
x = pd.Series([1,2,3])

In [20]:
x.dtype

dtype('int64')

In [21]:
x

0    1
1    2
2    3
dtype: int64

In [22]:
x[0]

1

In [23]:
x[0] = None

In [24]:
x

0    NaN
1    2.0
2    3.0
dtype: float64

In [25]:
x.dtype

dtype('float64')

In [26]:
# see it converts automatically to float

Typeclass Conversion when storing NAs  NA sentinel value
floating         No change                    np.nan
 object          No change                None or np.nan
 integer       Cast to float64                np.nan
 boolean       Cast to object             None or np.nan

# <font color='blue'> Operating on Null Values

isnull()
Generate a Boolean mask indicating missing values

notnull()
Opposite of isnull()

dropna()
Return a filtered version of the data

fillna()
Return a copy of the data with missing values filled or imputed

## Detecting null values

Two useful methods:
        -> isnull()
        -> notnull()

Either one will return a Boolean mask over the data

In [37]:
# Series

In [33]:
data = pd.Series([1,2,np.nan,'hello',None])

In [34]:
data

0        1
1        2
2      NaN
3    hello
4     None
dtype: object

In [35]:
data.notnull()

0     True
1     True
2    False
3     True
4    False
dtype: bool

In [36]:
data[data.notnull()]

0        1
1        2
3    hello
dtype: object

In [38]:
# DataFrame

In [39]:
data = pd.DataFrame([1,2,np.nan,'hello',None])

In [40]:
data

       0
0      1
1      2
2    NaN
3  hello
4   None

In [41]:
data.notnull()

       0
0   True
1   True
2  False
3   True
4  False

In [42]:
data[data.notnull()] # it returns entire dataframe

       0
0      1
1      2
2    NaN
3  hello
4    NaN

## Dropping null values

Two methods,
    -> dropna()
    -> fillna()

In [44]:
data = pd.Series([1,2,np.nan,'hello',None])

In [45]:
data

0        1
1        2
2      NaN
3    hello
4     None
dtype: object

In [46]:
data.dropna()

0        1
1        2
3    hello
dtype: object

In [47]:
data = pd.DataFrame([1,2,np.nan,'hello',None])

In [48]:
data.dropna()

       0
0      1
1      2
3  hello

In [49]:
df = pd.DataFrame([[1, np.nan, 2],[2, 3, 5],[np.nan, 4, 6]])

In [50]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

We cannot drop single values from a DataFrame; we can only drop full rows or full columns. Depending on the application, you might want one or the other, so
dropna() gives a number of options for a DataFrame.

In [51]:
df.dropna() # defaultly axis=0 (i.e) row

     0    1  2
1  2.0  3.0  5

In [52]:
df.dropna(axis = 'columns')

   2
0  2
1  5
2  6

In [53]:
df.dropna(axis = 'rows')

     0    1  2
1  2.0  3.0  5

But this drops some good data as well; you might rather be interested in dropping rows or columns with all NA values, or a majority of NA values

The default is how='any', such that any row or column (depending on the axis key‐word) containing a null value will be dropped. You can also specify how='all', which
will only drop rows/columns that are all null values:

In [54]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [56]:
df[3] = np.nan # adding another column

In [57]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [58]:
df.dropna(axis = 'columns', how = 'all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [59]:
# thresh

thresh parameter lets you specify a minimum number
of non-null values for the row/column to be kept:

In [63]:
df.dropna(axis = 'rows', thresh = 3)

     0    1  2   3
1  2.0  3.0  5 NaN

first and last rows removed, bcoz they have 2 null values

## Filling null values

Two methods,
    -> isnull()
    -> fillna()

In [64]:
data = pd.Series([1,np.nan,2,None,3], index = list('abcde'))

In [65]:
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

We can fill NA entries with a single value, such as zero:

In [66]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

We can specify a forward-fill to propagate the previous value forward:

In [67]:
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [68]:
data.fillna(method = 'ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

we can specify a back-fill to propagate the next values backward:

In [69]:
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [70]:
data.fillna(method = 'bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [72]:
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [74]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [75]:
df.fillna(method = 'ffill', axis = 1) # no value before means NaN

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0